################################################################################
# ZSH PLUGINS                                                                  #
################################################################################

brew "pure"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

################################################################################
# GENERAL TOOLS                                                                #
################################################################################

# gnu utilities (replacement for macOS utilities)
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "gnu-sed"
brew "gnu-tar"

# uutils utilities (replacement for macOS utilities)
# brew "uutils-coreutils"
# brew "uutils-findutils"
# brew "uutils-diffutils"

brew "tree"
brew "tmux"
brew "neovim"
brew "gnupg"
brew "ripgrep"
brew "fzf"
brew "fd"

brew "rsync"
brew "rclone"
brew "exitfool"
brew "ffmpeg"
brew "imagemagick"

brew "iperf3"
brew "wget"
brew "oha"
brew "xh"

################################################################################
# PROGRAMMING                                                                  #
################################################################################

brew "git"
brew "tokei"

brew "go"
brew "rust"
brew "pyenv"
brew "nodenv"

################################################################################
# CONTAINERIZATION                                                             #
################################################################################

# docker
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# podman (docker replacement)
# brew "podman"
# brew "podman-compose"

################################################################################
# APPLICATIONS                                                                 #
################################################################################

cask "firefox"
cask "ghostty"
cask "iina"
cask "obsidian"
cask "visual-studio-code"

################################################################################
# FONTS                                                                        #
################################################################################

cask "font-geist-mono-nerd-font"
