tap "homebrew/bundle"
brew "btop"
brew "colima"
brew "php"
brew "composer"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "exiftool"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gallery-dl"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "grep"
brew "gzip"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "p7zip"
brew "julia"
brew "less"
brew "luarocks"
brew "micromamba"
brew "neovim"
brew "pandoc"
brew "qrencode"
brew "ripgrep"
brew "rust"
brew "stow"
brew "tmux"
brew "tokei"
brew "tree"
brew "wget"
brew "yt-dlp"
cask "firefox"
cask "font-ubuntu-mono-nerd-font"
cask "temurin"
cask "wireshark"
