tap "homebrew/bundle"
brew "colima"
brew "coreutils"
brew "diffutils"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "exiftool"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gallery-dl"
brew "git"
brew "gnupg"
brew "go"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "micromamba"
brew "neovim"
brew "pandoc"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "stow"
brew "tmux"
brew "tokei"
brew "tree"
brew "wget"
brew "yazi"
brew "yt-dlp"
cask "alfred"
cask "firefox"
cask "font-ubuntu-mono-nerd-font"
cask "jetbrains-toolbox"
cask "temurin"
